cask_args appdir: "/Applications"

tap "heroku/brew"

brew "mas"
brew "zplug"
brew "nvim"
brew "nodenv/nodenv/jetbrains-npm"
brew "nodenv"

cask "1password"
cask "bartender"
cask "alfred"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "adobe-creative-cloud"
cask "zoomus"
cask "figma"
cask "github"
cask "dash"
cask "microsoft-excel"


mas "Slack", id: 803453959
mas "Fantastical 2", id: 975937182
mas "Trello", id: 1278508951
mas "LINE", id: 539883307
mas "Moving Dock", id: 435308051
mas "Magnet", id: 441258766
mas "Todoist", id: 585829637
mas "Yoink", id: 457622435
mas "XMind", id: 1327661892
